app/Http/Controllers/User/BankTransferController.php

		$code = getTrx();

			$user->balance -= $total;
			$user->save();
---
update `users` set `balance` = 680960945.42416, `users`.`updated_at` = '2025-09-24 06:06:52' where `id` = 1

				if($wallet == 'main')
				{
					$user->balance += $total;
					$user->save();
---
update `users` set `balance` = 680961495.42416, `users`.`updated_at` = '2025-09-24 06:06:54' where `id` = 1