app/Http/Controllers/User/InternetSmeController.php

                $user->ref_balance -= $payment;
            }

            $user->save();
---
update `users` set `balance` = 8995.368, `users`.`updated_at` = '2025-05-21 20:10:47' where `id` = '1'

                {
                    $user->ref_balance += $payment;
                }
                $user->save();
---
update `users` set `balance` = 2893.868, `users`.`updated_at` = '2025-05-21 18:40:22' where `id` = '1'

                $transaction->details      = 'Purchased SME internet data via ' . strToUpper($wallet).' Wallet';
                $transaction->trx          = $order->trx;
                $transaction->remark       = 'internet';
                $transaction->save();
---
insert into `transactions` (`user_id`, `amount`, `post_balance`, `charge`, `trx_type`, `details`, `trx`, `remark`, `updated_at`, `created_at`) values (1, '699.5', '9694.86800000', 0, '-', 'Purchased SME internet data via MAIN Wallet', 'YYF342VGXXZQ', 'internet', '2025-05-21 20:10:51', '2025-05-21 20:10:51')