app/Http/Helpers/helpers.php

select * from `extensions` where `act` = 'tawk-chat' and `status` = 1 limit 1
---
function loadExtension($key)
{
    $extension = Extension::where('act', $key)->where('status', Status::ENABLE)->first();

select * from `frontends` where `data_keys` = 'login.content' order by `id` desc limit 1
---
function getContent($dataKeys, $singleQuery = false, $limit = null, $orderById = false)
{
    if ($singleQuery) {
        $content = Frontend::where('data_keys', $dataKeys)->orderBy('id', 'desc')->first();

select * from `general_settings` limit 1
---
function gs()
{
    $general = GeneralSetting::first();