app/Http/Controllers/Gateway/PaymentController.php

    public function deposit()
    {
        $gatewayCurrency = GatewayCurrency::whereHas('method', function ($gate) {
            $gate->where('status', Status::ENABLE);
        })->with('method')->orderby('method_code')->get();
---
select * from `gateway_currencies` where exists (select * from `gateways` where `gateway_currencies`.`method_code` = `gateways`.`code` and `status` = 1) order by `method_code` asc