app/Http/Controllers/User/Auth/LoginController.php

    public function authenticated(Request $request, $user)
    {
        $sessionId = Str::uuid()->toString();
        $user->current_session_id = $sessionId;
        $user->tv = $user->ts == 1 ? 0 : 1;
        $user->save();
        $request->session()->put('current_session_id', $sessionId);
        $ip = getRealIP();
        $exist = UserLogin::where('user_ip', $ip)->first();
---
select * from `user_logins` where `user_ip` = '127.0.0.1' limit 1


        $userLogin->browser = @$userAgent['browser'];
        $userLogin->os = @$userAgent['os_platform'];
        $userLogin->save();
---
insert into `user_logins` (`longitude`, `latitude`, `city`, `country_code`, `country`, `user_id`, `user_ip`, `browser`, `os`, `updated_at`, `created_at`) values ('', '', '', '', '', 1, '127.0.0.1', 'Chrome', 'Windows 10', '2026-03-31 17:33:36', '2026-03-31 17:33:36')