app/Notify/NotifyProcess.php

    public function createLog($type)
    {
        $userColumn = $this->userColumn;
        if ($this->user && $this->createLog) {
            $notifyConfig = $this->notifyConfig;
            $config = $this->setting->$notifyConfig;
            $notificationLog = new NotificationLog();
            if (@$this->user->id) {
                $notificationLog->$userColumn = $this->user->id;
            }
            $notificationLog->notification_type = $type;
            $notificationLog->sender = @$config->name;
            $notificationLog->sent_from = $this->setting->email_from;
            $notificationLog->sent_to = $this->toAddress;
            $notificationLog->subject = $this->subject;
            $notificationLog->message = $type == 'email' ? $this->finalMessage : strip_tags($this->finalMessage);
            $notificationLog->save();
---
insert into `notification_logs` (`user_id`, `notification_type`, `sender`, `sent_from`, `sent_to`, `subject`, `message`, `updated_at`, `created_at`) values (1, 'sms', 'kudisms', 'info@ltechng.co', '07064257276', 'Internet Plan Purchased Successful', 'hi Oluwakayode Adetunji (test1234), You have purchased Gifting - 1.2GB Pulse Weekly  internet plan successfully.', '2025-05-21 20:10:53', '2025-05-21 20:10:53')